<!-- html部分 -->
<template>
	<div id="app">
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;margin-right: 20px;">
			<h2>企业能耗比对比图 (单位：亿tce)</h2>
			<ve-line :data="chartData"></ve-line>
		</div>
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;">
			<h2>企业作业量对比图 (单位：吨)</h2>
			<ve-histogram :data="chartData1"></ve-histogram>
		</div>
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;margin-right: 20px;">
			<h2> 设备完好率对比图 (单位：百分比)</h2>
			<ve-scatter :data="chartData4"></ve-scatter>
		</div>
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;">
			<h2> 企业耗水量对比图 (单位：立方米)</h2>
			<ve-line :data="chartData3"></ve-line>
		</div>
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;margin-right: 20px;">
			<h2> 企业耗油量对比图 (单位：升)</h2>
			<ve-funnel :data="chartData4"></ve-funnel>
		</div>
		<div class="chartss" style="width: 550px;height: 450px;display: inline-block;">
			<h2> 企业耗电量对比图 (单位：立方米)</h2>
			<ve-pie :data="chartData2"></ve-pie>
		</div>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		data() {
			return {
				chartData: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 10, '漯河港': 60, '刘湾港': 90,'日照港': 25 },
				    { '日期': '2月', '周口港': 12, '漯河港': 30, '刘湾港': 40,'日照港': 24 },
				    { '日期': '3月', '周口港': 30, '漯河港': 54, '刘湾港': 30,'日照港': 70 },
				    { '日期': '4月', '周口港': 34, '漯河港': 60, '刘湾港': 30,'日照港': 45 },
				    { '日期': '5月', '周口港': 80, '漯河港': 20, '刘湾港': 32,'日照港': 27 },
				    { '日期': '6月', '周口港': 20, '漯河港': 80, '刘湾港': 10,'日照港': 64 }
				  ]
				},
				chartData1: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 34, '漯河港': 78, '刘湾港': 56,'日照港': 25 },
				    { '日期': '2月', '周口港': 20, '漯河港': 87, '刘湾港': 40,'日照港': 95 },
				    { '日期': '3月', '周口港': 65, '漯河港': 45, '刘湾港': 20,'日照港': 74 },
				    { '日期': '4月', '周口港': 30, '漯河港': 32, '刘湾港': 63,'日照港': 10 },
				    { '日期': '5月', '周口港': 45, '漯河港': 14, '刘湾港': 47,'日照港': 20 },
				    { '日期': '6月', '周口港': 63, '漯河港': 25, '刘湾港': 24,'日照港': 45 }
				  ]
				},
				chartData2: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 34, '漯河港': 78, '刘湾港': 56,'日照港': 25 },
				    { '日期': '2月', '周口港': 20, '漯河港': 87, '刘湾港': 40,'日照港': 95 },
				    { '日期': '3月', '周口港': 65, '漯河港': 45, '刘湾港': 20,'日照港': 74 },
				    { '日期': '4月', '周口港': 30, '漯河港': 32, '刘湾港': 63,'日照港': 10 },
				    { '日期': '5月', '周口港': 45, '漯河港': 14, '刘湾港': 47,'日照港': 20 },
				    { '日期': '6月', '周口港': 63, '漯河港': 25, '刘湾港': 24,'日照港': 45 }
				  ]
				},
				chartData3: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 34, '漯河港': 78, '刘湾港': 56,'日照港': 25 },
				    { '日期': '2月', '周口港': 20, '漯河港': 87, '刘湾港': 40,'日照港': 95 },
				    { '日期': '3月', '周口港': 65, '漯河港': 45, '刘湾港': 20,'日照港': 74 },
				    { '日期': '4月', '周口港': 30, '漯河港': 32, '刘湾港': 63,'日照港': 10 },
				    { '日期': '5月', '周口港': 45, '漯河港': 14, '刘湾港': 47,'日照港': 20 },
				    { '日期': '6月', '周口港': 63, '漯河港': 25, '刘湾港': 24,'日照港': 45 }
				  ]
				},
				chartData4: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 34, '漯河港': 78, '刘湾港': 56,'日照港': 25 },
				    { '日期': '2月', '周口港': 20, '漯河港': 87, '刘湾港': 40,'日照港': 95 },
				    { '日期': '3月', '周口港': 65, '漯河港': 45, '刘湾港': 20,'日照港': 74 },
				    { '日期': '4月', '周口港': 30, '漯河港': 32, '刘湾港': 63,'日照港': 10 },
				    { '日期': '5月', '周口港': 45, '漯河港': 14, '刘湾港': 47,'日照港': 20 },
				    { '日期': '6月', '周口港': 63, '漯河港': 25, '刘湾港': 24,'日照港': 45 }
				  ]
				},
				chartData5: {
				  columns: ['日期', '周口港', '漯河港', '刘湾港','日照港'],
				  rows: [
				    { '日期': '1月', '周口港': 34, '漯河港': 78, '刘湾港': 56,'日照港': 25 },
				    { '日期': '2月', '周口港': 20, '漯河港': 87, '刘湾港': 40,'日照港': 95 },
				    { '日期': '3月', '周口港': 65, '漯河港': 45, '刘湾港': 20,'日照港': 74 },
				    { '日期': '4月', '周口港': 30, '漯河港': 32, '刘湾港': 63,'日照港': 10 },
				    { '日期': '5月', '周口港': 45, '漯河港': 14, '刘湾港': 47,'日照港': 20 },
				    { '日期': '6月', '周口港': 63, '漯河港': 25, '刘湾港': 24,'日照港': 45 }
				  ]
				}
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
